import React, { useState } from 'react';
import { Title } from './../../Items';
import Faq from "react-faq-component";
import styles from './FAQ.module.scss';
import './FAQ.css';

const FAQ = () => {


    const [rows, setRowsOption] = useState(null);
    const data = {
        rows: [
            {
                title: "Հնարավո՞ր է դասերին միանալ հեռախոսով/ սմարթֆոնով:",
                content: "Արդյունավետության տեսանկյունից ելնելով առավել նպատակահարմար է դասերին միանալ պլանշետով, կամ համակարգչով։ Սակայն հետախոսով ևս հնարավոր է միանալ:",
            },
            {
                title: "Որո՞նք են փորձնական դասին հաջորդող քայլերը:",
                content: "Ուսուցչի հետ կապ հաստատելուց և մեկ փորձնական անվճար դասից հետո Դուք պետք է համապատասխան դասընթացի համար կատարեք վճարում: Վճարումը կարող է կատարվել ամբողջական դասընթացի համար կամ մաս-մաս՝ ըստ փուլերի: Ամբողջական դասընթացի համար վճարելու դեպքում, սովորողը կարող է ստանալ զեղջեր: Վճարումը կարող եք կատարել Visa, MasterCard հաշվարկային քարտերով կամ idram արագ փոխանցման համակարգով: Կարող եք փոխանցումներ կատարել ցանկացած արտարժույթով ըստ Հայաստանի Հանրապետության կենտրոնական բանկի համապատասխան փոխարժեքի:",
            },
            {
                title: "Ինչպե՞ս է կազմվում դասերի գրաֆիկը:",
                content: "Փորձնական դասի ընթացքում ուսուցիչը կպատասխանի Ձեզ հուզող հարցերին և Ձեզ հետ միասին կկատարի դասերի ժամանակացույցի նախնական պլանավորում:",
            },
            {
                title: "Որքա՞ն է դասի տևողությունը:",
                content: "Դասի տևողությունը  1 ժամ է, քանի որ ըստ մասնագետների դա այս մաքսիմալ ժամանակահատվածն է, որի ընթացքում աշակերտը կարող է կենտրոնանալ նյութի վրա և ամբողջովին յուրացնել այն։",
            },
            {
                title: "Ինչպե՞ս պետք է միանալ դասին:",
                content: "Օնլայն ուսուցումը իրականացվում է Skype ծրագրի միջոցով:",
                active: false
            },
            {
                title: "Որո՞նք են անգլերեն լեզվի ծրագրի առավելությունները:",
                content: "Ի տարբերություն այլ լեզուների, անգլերենի ծրագրի առավելությունը կայանում է նրանում, որ այժմ կան մշակված բավականին էֆֆեկտիվ մեթոդներ, ինչպես նաև հարուստ գրականություն, ինչը թույլ է տալիս մասնագետներին գտնել յուրաքանչյուր աշակերտին մաքսիմալ համապատասխան մոտեցում և բավականին սեղմ ժամկետներում աշակերտի հետ միասին ունենալ տեսանելի արդյունք։",
            },
            {
                title: "Որքանո՞վ է արդյունավետ ուսուցումն օնլայն հարթակում:",
                content: "Օնլայն դասավանդման միջազգային փորձի ուսումնասիրությունը և մեր վեց տարիների փորձառությունը հաստատում են, որ դասավանդման օնլայն տարբերակը իր արդյունավետությամբ չի զիջում ավանդական ձևին: Ժամանակակից տեղեկատվական տեխնորոգիաների և գործիքների օգտագործումը ուսուցման ընթացքում, այդ գործընթացը դարձնում են էլ ավելի հետաքրքիր և բարձրացնում են դասավանդման արդյունավետությունը:",
            }
        ]
    };

    return (
        <section className={styles.FAQ}>
            <div className="container">
                <Title name="Հաճախ տրվող հարցեր" />
                <div className={styles.FAQ__content}>
                    <Faq data={data} getRowOptions={setRowsOption} />
                </div>
            </div>
        </section>
    )
}

export default FAQ;